<template>
  <course-header :item="item" @bookmark="bookmark" />
  <div class="tabs bg-white" id="tabs">
    <v-container class="pa-0">
      <v-tabs selected-class="text-button-primary" hide-slider height="72">
        <v-tab
          :value="1"
          class="text-text-disabled text-button-1 font-weight-bold"
          href="#description"
          >{{ $t("description") }}</v-tab
        >
        <v-tab
          :value="2"
          class="text-text-disabled text-button-1 font-weight-bold"
          href="#goals"
          >{{ $t("course_goals") }}</v-tab
        >
        <v-tab
          :value="3"
          class="text-text-disabled text-button-1 font-weight-bold"
          href="#headlines"
          >{{ $t("headlines") }}</v-tab
        >
        <v-tab
          :value="4"
          class="text-text-disabled text-button-1 font-weight-bold"
          href="#comments"
          >{{ $t("user_comments") }}</v-tab
        >
        <v-tab
          :value="5"
          class="text-text-disabled text-button-1 font-weight-bold"
          href="#teacher"
          >{{ $t("teacher") }}</v-tab
        >
        <v-tab
          :value="6"
          class="text-text-disabled text-button-1 font-weight-bold"
          href="#faq"
          >{{ $t("faq") }}</v-tab
        >
        <v-spacer></v-spacer>
        <v-tab :value="7" v-if="sticked">
          <div>
            <span class="text-high-emphasis text-body-2 ml-4">
              {{ item.participantsCount + $t("course_participants") }}
            </span>
            <v-btn color="primary-base" variant="flat" class="text-button">
              {{ $t("enroll_course") }}
            </v-btn>
          </div>
        </v-tab>
      </v-tabs>
    </v-container>
  </div>
  <div class="bg-background-dark mb-12">
    <v-container>
      <v-row>
        <v-col id="description" cols="12" lg="8" :order="!lgAndUp ? '2' : '1'">
          <course-description :item="item" />
        </v-col>
        <v-col id="preview" cols="12" lg="4" :order="!lgAndUp ? '1' : '2'">
          <course-preview :item="item" />
        </v-col>
        <v-col id="goals" cols="12" order="3">
          <course-goals :item="item" />
        </v-col>
        <v-col id="headlines" cols="12" v-if="item?.chapters?.length" order="4">
          <course-headlines :item="item" />
        </v-col>
        <v-col
          v-if="item.certificateEnabled"
          id="certificate"
          cols="12"
          order="5"
        >
          <course-certificate :item="item" />
        </v-col>
        <v-col id="comments" cols="12" v-if="item?.comments?.length" order="6">
          <course-user-comments :item="item" />
        </v-col>
      </v-row>
    </v-container>
    <course-about-teacher id="teacher" :item="item" />
    <v-container
      id="faq"
      class="pt-10 pb-0 pt-lg-10"
      v-if="item?.faq?.content?.faq?.length"
    >
      <app-content type="faq" :content="item?.faq?.content"></app-content>
    </v-container>
  </div>
</template>

<script setup>
import { useDisplay } from "vuetify";

const { lgAndUp, mobile } = useDisplay();
let section = null;
let tabs = ref(null);
let sticky = ref(null);
let sticked = ref(null);
const item = reactive({});
const route = useRoute();
const { $repos } = useNuxtApp();
let preview = !!route.query.preview;

const myFunction = () => {
  sticked.value = window.pageYOffset > sticky;
  if (window.pageYOffset > sticky) {
    tabs.classList.add("sticky");
  } else {
    tabs.classList.remove("sticky");
  }
};

const bookmark = () => {
  $repos.academy
    .bookmark({
      courseId: item.id,
      bookmark: !!!item.currentUserBookmarked,
    })
    .then(() => (item.currentUserBookmarked = !item.currentUserBookmarked));
};

useAsyncData(async () => {
  if (!preview) {
    await $repos.academy
      .getCourse({
        slug: route.params.slug,
      })
      .then((res) => Object.assign(item, res));
  }
});

const getCoursePreview = () => {
  let payload = { id: route.params.slug };
  $repos.academy.coursePreview(payload).then((res) => {
    Object.assign(item, res);
  });
};
onMounted(() => {
  console.log('previeewwww',preview)
  tabs = document.getElementById("tabs");
  sticky = tabs.offsetTop;
  window.onscroll = function () {
    console.log("onscroll");
    myFunction();
  };
  if (preview) getCoursePreview();
});

const faq = [
  {
    title: "ویدیوها و مقاله‌های آموزشی را از کجا می‌توانم مشاهده و دانلود کنم؟",
    text: "توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره ",
  },
  {
    title: "ویدیوها و مقاله‌های آموزشی را از کجا می‌توانم مشاهده و دانلود کنم؟",
    text: "توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره ",
  },
  {
    title: "ویدیوها و مقاله‌های آموزشی را از کجا می‌توانم مشاهده و دانلود کنم؟",
    text: "توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره ",
  },
  {
    title: "ویدیوها و مقاله‌های آموزشی را از کجا می‌توانم مشاهده و دانلود کنم؟",
    text: "توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره ",
  },
  {
    title: "ویدیوها و مقاله‌های آموزشی را از کجا می‌توانم مشاهده و دانلود کنم؟",
    text: "توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره ",
  },
  {
    title: "ویدیوها و مقاله‌های آموزشی را از کجا می‌توانم مشاهده و دانلود کنم؟",
    text: "توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره ",
  },
  {
    title: "ویدیوها و مقاله‌های آموزشی را از کجا می‌توانم مشاهده و دانلود کنم؟",
    text: "توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره توضیحات درباره مدرس دوره ",
  },
];
</script>

<style scoped>
.sticky {
  position: fixed;
  bottom: 0;
  width: 100%;
  z-index: 1000;
  box-shadow: 0px -2px 2px 0px #0000000d;
  box-shadow: 0px -1px 1px 0px #00000024;
  transition: position 4s;
}

:target {
  scroll-margin-top: 100px;
}
</style>
