<template>
  <ad-services-header />
  <v-container>
    <div class="text-center text-h2 text-text-heading mt-16 pt-4">
      {{ $t("digikala_services_introduction") }}
    </div>
    <ad-services-service
      v-for="item in services"
      :item="item"
      class="my-5"
      :key="item.id"
      :reverse="item.id == 2"
    />
  </v-container>
  <ad-services-ad />
</template>

<script setup>
const { t } = useI18n();
const services = ref([
  {
    id: 1,
    title: "شگفت‌انگیز سفارشی",
    subtitle: "بهترین راه برای نمایش بیشتر کالا",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
  },
  {
    id: 2,
    title: "تبلیغات جستجو محور",
    subtitle: "بهترین راه برای نمایش بیشتر کالا",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
  },
  {
    id: 3,
    title: "تبلیغات خارج دیجی‌کالا",
    subtitle: "بهترین راه برای نمایش بیشتر کالا",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
  },
]);

useHead(
  useHeadTags({
    title: t("ad_service"),
    description: "سرویس تبلیغاتی دیجی‌کالا، سکوی پرتاب کسب و کار شما",
  })
);
</script>
